req.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery"><soap:Header><wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To><wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Bye</wsa:Action><wsa:MessageID>urn:uuid:96edb128-465f-4fd2-be02-f88163fb6000</wsa:MessageID><wsd:AppSequence InstanceId="6" SequenceId="urn:uuid:26af2513-c220-4d9b-8366-358d98fafb35" MessageNumber="151"></wsd:AppSequence></soap:Header><soap:Body><wsd:Bye><wsa:EndpointReference><wsa:Address>urn:uuid:6e9cf602-b1c8-422a-b09d-7ebcc0d787bf</wsa:Address></wsa:EndpointReference></wsd:Bye></soap:Body></soap:Envelope>